
**@flexwie suggests the following changes in this pull_request:**  

```terraform

Acquiring state lock. This may take a few moments...
hcloud_server.node1: Refreshing state... [id=15641843]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # hcloud_server.node1 has been changed
  ~ resource "hcloud_server" "node1" {
        id                 = "15641843"
      + labels             = {}
        name               = "node1"
        # (13 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # hcloud_network.network will be created
  + resource "hcloud_network" "network" {
      + delete_protection = false
      + id                = (known after apply)
      + ip_range          = "10.0.0.0/16"
      + name              = "network"
    }

  # hcloud_network_subnet.subnet will be created
  + resource "hcloud_network_subnet" "subnet" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.1.0/24"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # hcloud_server.node1 will be updated in-place
  ~ resource "hcloud_server" "node1" {
        id                 = "15641843"
        name               = "node1"
        # (14 unchanged attributes hidden)

      + network {
          + alias_ips   = []
          + ip          = "10.0.1.5"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: iaac.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "iaac.tfplan"
Releasing state lock. This may take a few moments...

```

